@przsab downsizing disk does trigger recreation which is intended. Below is what I got. 

```
  # google_compute_disk.disk01 must be replaced
-/+ resource "google_compute_disk" "disk01" {
      ~ creation_timestamp        = "2021-03-04T10:18:30.628-08:00" -> (known after apply)
      ~ id                        = "projects/myproject/zones/us-central1-a/disks/issue8597" -> (known after apply)
      ~ label_fingerprint         = "42WmSpB8rSM=" -> (known after apply)
      - labels                    = {} -> null
      + last_attach_timestamp     = (known after apply)
      + last_detach_timestamp     = (known after apply)
        name                      = "issue8597"
      ~ physical_block_size_bytes = 4096 -> (known after apply)
      ~ project                   = "myproject" -> (known after apply)
      ~ self_link                 = "https://www.googleapis.com/compute/v1/projects/myproject/zones/us-central1-a/disks/issue8597" -> (known after apply)
      ~ size                      = 10 -> 5 # forces replacement
      + source_image_id           = (known after apply)
      + source_snapshot_id        = (known after apply)
        type                      = "pd-standard"
      ~ users                     = [] -> (known after apply)
      ~ zone                      = "us-central1-a" -> (known after apply)
    }
```